In [1]:
import pandas as pd

In [2]:
#create a simple dataset of people

data ={'Name':["Ananya","Nishanth","Riddhi"],
       'Location':["Mumbai","Hyderabad","Gurgaon"],
       'Age':[20, 21, 22]}

df = pd.DataFrame(data)
print(df)

       Name   Location  Age
0    Ananya     Mumbai   20
1  Nishanth  Hyderabad   21
2    Riddhi    Gurgaon   22

In [3]:
display(df[df.Age>20])

       Name   Location  Age
1  Nishanth  Hyderabad   21
2    Riddhi    Gurgaon   22